Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བདག་གིས་ཀྱང་རིགས་ཀྱི་བུ་དེ་ལ་མཆོད་པ་བྱའོ། །བདག་ཀྱང་འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་བླ་ན་མེད་པ་ཐམས་ཅད་མཁྱེན་པའི་བར་དུ་གང་ཁྱོད་ཀྱིས་བཤད་པ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་སྨྲས་སོ།
en: I too shall worship that noble sir and I too shall perfect the attributes of the buddhas, such as you have described, up to and including unsurpassed all-aspect omniscience.”

source: །དེ་བས་ན་ཡབ་ཡུམ་ནོར་མང་པོ་ཕལ་ཆེར་བདག་ལ་སྩལ་ཏེ།
en: Therefore, mother and father, grant me an abundance of wealth!

source: བདག་རིགས་ཀྱི་བུ་འདི་དང་ལྷན་ཅིག་ཏུ་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་མཆོད་པ་བགྱིད་དུ་མཆི་བར་ཅི་གནང་།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བདུན་ཅུ་བརྒྱད་པ།
en: Will you permit me to make offerings, along with this noble son, to the sublime bodhisattva great being Dharmodgata?’ {

source: དེ་ནས་བུ་མོ་དེའི་ཕ་མ་གཉིས་ཀྱིས་བུ་མོ་དེ་ལ་འདི་སྐད་སྨྲས་སོ། །བུ་མོ་ཁྱོད་ཀྱིས་རིགས་ཀྱི་བུ་དེའི་གཏམ་བྱས་པ་ནི་རབ་ཏུ་དཀའོ།
en: Va.249} “Then the parents of that girl replied, ‘Daughter, the story of this noble son that you have related is one of great hardship.

source: །འཇིག་རྟེན་ཐམས་ཅད་ལས་འཕགས་པ་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་བྱེད་པའི་ཆོས་གང་གི་ཕྱིར་རིགས་ཀྱི་བུ་དེ་འདི་ལྟ་བུའི་དཀའ་བ་ཉམས་སུ་ལེན་པའི་ཆོས་དེ་དག་ཀྱང་ཤིན་ཏུ་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: These attributes for which this noble son would experience such hardship in order to bring happiness to all beings are the most distinguished in all world systems, utterly inconceivable.

source: །དེ་བས་ན་བུ་མོ་ཁྱོད་ངེད་ཀྱིས་གནང་ངོ་།
en: Therefore, we permit you to go.

source: །ངེད་ཀྱང་ཁྱོད་དང་ལྷན་ཅིག་ཏུ་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེ་བལྟ་བ་དང་། མཆོད་པ་བྱེད་དུ་འདོང་གིས་སྐབས་བྱིན་ཅིག།
en: Let us accompany you too to see and worship that sublime bodhisattva great being Dharmodgata!’ “

source: དེ་ནས་བུ་མོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་མཆོད་པ་དང་། བཀུར་སྟིར་བྱེད་དུ་འདོང་འདོད་པའི་ཕ་མ་གཉིས་ལ་འདི་སྐད་སྨྲས་སོ། །བདག་ནི་སུ་ལ་ཡང་དགེ་བའི་བར་ཆད་མི་བགྱིད་དོ།
en: Thereupon the girl replied to her parents who wished to go to worship and venerate the bodhisattva great being Dharmodgata, ‘I would not obstruct anyone from virtuous actions.’ “

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་དེ་དང་དེའི་ཕ་མ་ལ་སྩོགས་པས་ཤིང་རྟ་ལྔ་བརྒྱ་བརྒྱན། བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་ཡང་བརྒྱན་ནས། མེ་ཏོག་སྣ་ཚོགས་རྣམས་ཐོགས། གོས་རྣམ་པ་སྣ་ཚོགས་དང་། བདུག་པ་དང་། སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ཆོས་གོས་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་རྣམས་ཐོགས། གསེར་གྱི་མེ་ཏོག་དང་། དངུལ་གྱི་མེ་ཏོག་རྣམས་ཐོགས།
en: Then the merchant’s daughter, accompanied by her parents, furnished with five hundred carriages and also furnished with those five hundred maidens, brought a variety of flowers, a variety of clothing, incense, perfume, garlands, unguents, powders, religious robes, parasols, victory banners, and ribbons, and she brought golden flowers and silver flowers.

source: རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་དང་། གསེར་དང་ནོར་བུ་དང་མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། དུང་དང་ཤེལ་དང་བྱི་རུ་རྣམས་ཐོགས། བཟའ་བ་དང་།
en: She brought a variety of jewels, gold, gems, pearls, beryl, conch, crystal, and coral, and she brought an abundance of food, delicacies, and drinks.

source: བཅའ་བ་དང་། བཏུང་བ་མང་པོ་ཐོགས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དང་ལྷན་ཅིག་ཏུ་ཤིང་རྟ་གཅིག་ལ་ཞོན། བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་ཀྱང་ཤིང་རྟ་ལྔ་བརྒྱ་ལ་ཞོན་པས་ཡོངས་སུ་བསྐོར། མདུན་དུ་བྱས་ནས་འཁོར་མང་པོ་དང་ལྷན་ཅིག་ཏུ་ཤར་ཕྱོགས་ཀྱི་ཕྱོགས་གང་ན་བ་དེར་ལོགས་སུ་དོང་ངོ་།
en: She rode in one carriage together with the bodhisattva great being Sadāprarudita, with an entourage comprising those five hundred maidens, who rode in their five hundred carriages, and they set out in the vanguard, toward the east, accompanied by a huge retinue. “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་མཐར་གྱིས་སོང་སོང་ན། རྒྱང་རིང་པོ་ཞིག་ནས་སྤོས་ཅན་གྱི་གྲོང་ཁྱེར་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ་མཛེས་ཤིང་ལྟ་ན་སྡུག་པ། རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་ར་བ་བདུན་གྱིས་བསྐོར་བ། རྟ་བབས་བདུན་དང་ལྡན་པ། འོབས་བདུན་དང་།
en: Finally, after some time, the bodhisattva great being Sadāprarudita saw the city of Gandhavati from a distance, constructed of the seven precious materials, beautiful and magnificent to behold, twelve yojanas in length and twelve yojanas in breadth.

source: ཤིང་རྟ་ལའི་ཕྲེང་བ་བདུན་གྱིས་བསྐོར་བ། ཆུར་དཔག་ཚད་བཅུ་གཉིས་ཡོད་པ། ཞེང་དུ་ཡང་དཔག་ཚད་བཅུ་གཉིས་ཡོད་པ། ཕྱུག་ཅིང་དར་བ། བདེ་ཞིང་སྐྱིད་པ།
en: It was surrounded by seven perimeter walls fashioned of the seven precious materials, with seven arches, and surrounded by seven moats and seven rows of palm trees, prosperous, flourishing, secure, happy, and joyful, with a large population, with five hundred roadside stalls, as if drawn in a painting, with bridges offering access to vehicles and pedestrians.

source: མི་མང་པོས་རྒྱས་པ། ཚོང་འདུས་ཀྱི་སྲང་རི་མོ་ལ་བྲིས་པ་ལྟ་བུ་ལྔ་བརྒྱ་དང་ལྡན་པ། བཞོན་པ་ལྷན་ཅིག་ཏུ་གཤིབས་ཏེ་འགྲོ་བའི་ཟམ་པ་དང་བཅས་པ་དེ་ལྟ་བུ་མཐོང་ངོ་། །ལམ་གྱི་མདོའི་དབུས་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ཆོས་ཀྱི་སྟན་གྱི་སྟེང་ན། འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བྱས་ནས་ཆོས་འཆད་ཅིང་འདུག་པ་མཐོང་ངོ་།
en: At the center of the crossroads he also saw, seated upon the throne of the Dharma, the bodhisattva great being Dharmodgata, who was teaching the Dharma, surrounded by an assembly of many hundred thousands, facing toward him.

source: །དེས་མཐོང་མ་ཐག་ཏུ་འདི་ལྟ་བུའི་བདེ་བ་ཐོབ་པ་ནི་དཔེར་ན། བསམ་གཏན་དང་པོ་ལ་མཉམ་པར་བཞུགས་པའི་དགེ་སློང་སེམས་རྩེ་གཅིག་ཏུ་བཞག་པ་དེ་ལྟ་བུའི་བདེ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: The moment he saw him he was filled with bliss, such as that which a monk with one-pointed absorption acquires when absorbed in the first meditative concentration. “

source: །མཐོང་ནས་ཀྱང་འདི་སྙམ་དུ་བདག་ཤིང་རྟ་ལ་ཞོན་བཞིན་དུ་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་དྲུང་དུ་འགྲོ་བ་མི་རིགས་སོ་སྙམ་དུ་བསམས་ནས།
en: Seeing him, he thought, ‘It would not be appropriate for me to approach the sublime bodhisattva great being Dharmodgata riding in a carriage.’

source: དེ་ཤིང་རྟ་ལས་བབས་སོ། །ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སྩོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་ཀྱང་ཤིང་རྟ་དེ་དག་ལས་བབས་སོ།
en: He dismounted, and the five hundred maidens headed by the merchant’s daughter also dismounted from their carriages.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དེ་ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སྩོགས་པ་བུ་མོ་ལྔ་བརྒྱས་ཡོངས་སུ་བསྐོར། མདུན་དུ་བྱས་ནས་དཔག་ཏུ་མེད་པའི་རྒྱན་རྣམས་ཐོགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་གང་ན་བ་དེར་སོང་ངོ་།
en: Then the bodhisattva great being Sadāprarudita, accompanied by the merchant’s daughter and her five hundred maidens, went forward, holding their inestimable ornaments, and approached the place where the bodhisattva great being Dharmodgata was seated. “

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཁང་པ་རྩེག་མ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ་ཞིག་བྱས་ཏེ། ཙན་དན་དམར་པོས་བརྒྱན་པ། མུ་ཏིག་གི་དྲ་བ་བྲེས་པ། རྩེག་ཁང་གི་གྲུ་བཞིར་མེ་མར་གྱིས་སྣང་བ་བྱ་བའི་ཕྱིར། ནོར་བུ་རིན་པོ་ཆེ་འོད་གསལ་བ་རྣམས་བཀོད་དོ།
en: On that occasion the bodhisattva great being Dharmodgata had created, for the [purpose of teaching] the perfection of wisdom, a tower, made of the seven precious materials, adorned with red sandalwood, bedecked with strings of pearls, and in the four corners of the tower luminous gemstones were placed to perform the function of lamps. {

source: །དངུལ་གྱི་པོག་ཕོར་བཞི་ཡང་བར་སྣང་ལས་འཕྱང་དུ་བཅུག་སྟེ། དེ་ན་ཨ་ཀ་རུ་ནག་པོ་གཙང་མའི་བདུག་པ་རྣམས་འཐུལ་བ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མཆོད་པའི་ཕྱིར་རོ།
en: Va.250} Four silver censers were suspended in the air, and in them burned incense of pure black eaglewood, as an offering to the perfection of wisdom.

source: །རྩེག་ཁང་དེའི་ནང་ན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་ཁྲི་བཞག་སྟེ། དེའི་སྟེང་དུ་རིན་པོ་ཆེའི་སྒྲོམ་བཞི་བཞག་གོ །
en: Within that tower a [teaching] throne was positioned, made of the seven precious materials, and on it was placed a casket with four gemstones.

source: དེའི་ནང་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གསེར་གྱི་གླེགས་བམ་ལ་བཻ་ཌཱུརྱ་མཐིང་ཀ་ཞུན་མས་བྲིས་པ་བཞུགས་སོ།
en: Inside that, the Perfection of Wisdom was kept, inscribed in molten blue beryl on gold tablets.

source: །རྩེག་ཁང་དེ་ཡང་མེ་ཏོག་དང་དར་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་རྣམས་ཀྱིས་སྤྱངས་པས་རབ་ཏུ་བརྒྱན་ཏོ།
en: The tower was also adorned with garlands of various flowers and suspended silk hangings. “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དེ། ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སྩོགས་པ་བུ་མོ་ལྔ་བརྒྱ་དང་བཅས་པས་ཁང་པ་རྩེག་མ་དེ་དཔག་ཏུ་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ་མཐོང་ངོ་། །ལྷ་སྟོང་ཕྲག་དུ་མ་རྣམས་ཀྱང་མཐོང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཡང་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དང་། ལྷའི་ཙན་དན་གྱི་ཕྱེ་མ་དང་།
en: The bodhisattva great being Sadāprarudita and the merchant’s daughter with her five hundred maidens looked upon that tower, adorned with inestimable ornaments, and they saw many thousands of gods.

source: ལྷའི་གསེར་གྱི་ཕྱེ་མ་དང་། ལྷའི་དངུལ་གྱི་ཕྱེ་མས་ཁང་པ་རྩེག་མ་དེ་དག་ལ་ཀུན་དུ་མཐོར། མངོན་པར་འཐོར། རབ་ཏུ་མངོན་པར་འཐོར་བ་དང་། ལྷའི་སིལ་སྙན་དག་སྒྲོག་པ་ཐོས་ནས།
en: Śakra, mighty lord of the golds, was also present, sprinkling, strewing, and showering down over that tower divine coral flowers, divine sandalwood powder, divine gold powder, and divine silver powder, and they heard the sound of divine musical instruments.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་སྨྲས་སོ། །ལྷའི་དབང་པོ་ཁྱོད་ཅིའི་ཕྱིར་ལྷ་སྟོང་ཕྲག་དུ་མ་དང་། ལྷན་ཅིག་ཏུ་རིན་པོ་ཆེའི་ཁང་པ་རྩེག་མ་འདི་ལ། མེ་ཏོག་མན་དཱ་ར་བ་དང་། ཙན་དན་གྱི་ཕྱེ་མ་ལ་སྩོགས་པས་འཐོར། མངོན་པར་འཐོར། ལྷའི་སིལ་སྙན་འདི་དག་ཀྱང་བར་སྣང་ལས་ལྷ་རྣམས་ཅིའི་ཕྱིར་སྒྲོགས།
en: The bodhisattva great being Sadāprarudita then asked Śakra, mighty lord of the golds, ‘Lord of the gods, why are you, together with many thousands of gods, sprinkling, strewing, and showering down over this tower fashioned of gemstones, coral flowers, sandalwood powders and so forth, and why do the gods play music in the air?’ “

source: དེ་སྐད་སྨྲས་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་མི་ཤེས་སམ།
en: Śakra, mighty lord of the gods replied to the bodhisattva great being Sadāprarudita, ‘Noble son, do you not know?

source: འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་གཅེས་པའི་ཡུམ། སྐྱེད་པར་མཛད་པ་བསྐྲུན་པ། གཙོ་མོ་ཡིན་ཏེ་གང་ལ་བསླབས་ན།
en: This is the Perfection of Wisdom, the dear mother of bodhisattva great beings, the progenitor, the matrix giving birth to them.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བའོ། །དེ་སྐད་སྨྲས་པ་དང་།
en: When they have trained in it, bodhisattva great beings will acquire the perfection of all enlightened attributes, all the qualities of the buddhas, and all-aspect omniscience.’ “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་སྨྲས་སོ། །ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་གཅེས་པའི་ཡུམ་སྐྱེད་པར་མཛད་པ་སྐྲུན་པའི་གཙོ་མོ་དེ་གང་ན་བཞུགས།
en: The bodhisattva great being Sadāprarudita replied to Śakra, mighty lord of the gods, ‘Kauśika, where is this Perfection of Wisdom, the dear mother of bodhisattva great beings, the progenitor, and matrix giving birth to them?’ “

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། འོ་ན་ལྟ་ཁང་པ་རྩེག་མའི་ནང་ན། གསེར་གྱི་གླེགས་བམ་ལ་བཻ་ཌཱུརྱ་མཐིང་ཀ་ཞུན་མས་བྲིས་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པས། རྒྱ་བདུན་གྱིས་བཏབ་སྟེ་བཞག་པས།
en: Śakra replied, ‘The bodhisattva great being Dharmodgata has placed it inside the tower, inscribed in molten beryl on gold tablets, and sealed it with seven seals.

source: དེ་བདག་ཅག་གིས་ཁྱེད་ལ་བསྟན་དུ་མི་རུང་ངོ་། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ། ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སོགས་པ།
en: We cannot show it to you.’ “

source: བུ་མོ་ལྔ་བརྒྱ་དང་ལྷན་ཅིག་ཏུ་ཚོགས་པས། མེ་ཏོག་དང་ཕྲེང་བ་དང་། གོས་དང་རིན་པོ་ཆེ་དང་བདུག་པ་དང་། སྤོས་དང་བྱུག་པ་དང་། ཕྱེ་མ་དང་ཆོས་གོས་དང་། གདུགས་དང་།
en: Thereupon the bodhisattva great being Sadāprarudita and the merchant’s daughter, with her five hundred maidens, gathered together and they made offerings to the Perfection of Wisdom with the flowers, garlands, clothing, jewels, incense, perfume, unguents, powders, religious robes, parasols, victory banners, ribbons, and the gold and silver flowers that they had brought along, and among these, they deposited some as an offering to the bodhisattva great being Dharmodgata.

source: རྒྱལ་མཚན་དང་། བ་དན་དང་། གསེར་དང་། དངུལ་གྱི་མེ་ཏོག་བདག་ཅག་གིས་ཁྱེར་ཏེ་འོངས་པ་དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མཆོད་པ་བྱས་ཏེ། དེ་དག་ལས་ཁ་ཅིག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་མཆོད་པའི་ཕྱིར་བཞག་གོ །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས། མེ་ཏོག་དང་བདུག་པ་དང་སྤོས་དང་ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྔར་མཆོད་པ་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་གང་ན་བ་དེར་སོང་ངོ་། །སོང་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་མེ་ཏོག་དང་། བདུག་པ་དང་།
en: Then, after first presenting these offerings of flowers, incense, perfume, garlands, unguents, powders, clothing, parasols, victory banners, ribbons, and diverse musical instruments to the perfection of wisdom, the bodhisattva great being Sadāprarudita approached the place where the bodhisattva great being Dharmodgata was seated.

source: སྤོས་དང་། ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་། གོས་དང་གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་དང་ཙན་དན་གྱི་ཕྱེ་མ་དང་། གསེར་དང་དངུལ་གྱི་མེ་ཏོག་རྣམས་ཀྱིས་ཆོས་ལ་མཆོད་པ་ཉིད་ཀྱི་ཕྱིར་ཀུན་ཏུ་གཏོར།
en: Going there, he sprinkled, scattered, and showered the bodhisattva great being Dharmodgata with flowers, incense, perfume, garlands, unguents, powders, clothing, parasols, victory banners, ribbons, sandalwood powders, and gold and silver flowers, in order to worship the Dharma. “

source: མངོན་པར་གཏོར། རབ་ཏུ་མངོན་པར་གཏོར་ཏོ། །དེ་ནས་མེ་ཏོག་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་སྟེང་དུ་མེ་ཏོག་གི་རྩེག་ཁང་དུ་གནས་པར་གྱུར་ཏོ།
en: Those flowers formed a floral tower above [the head of] the bodhisattva great being Dharmodgata.

source: །གསེར་དང་དངུལ་གྱི་མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་པ་དེ་དག་ཀྱང་ནམ་མཁའ་ལ་གཞལ་ཡས་ཁང་དུ་གནས་པར་གྱུར་ཏོ།
en: The diversely colored gold and silver flowers {Va.251} also formed a celestial palace in the sky.

source: །ཆོས་གོས་དང་། གོས་རིན་པོ་ཆེ་དེ་དག་ཀྱང་བར་སྣང་ལ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྤྲིན་ལྟ་བུར་གནས་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དང་།
en: The religious robes, clothing, and jewels formed, as it were, a cloud of diverse precious materials in the air.

source: ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་དེ་ལྟ་བུ་མཐོང་ནས་འདི་སྙམ་དུ་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་འདི་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ་དང་། དེ་ལྟར་མཐུ་ཆེ་བ་དང་། དེ་ལྟར་གཟི་བརྗིད་ཆེ་བ་ངོ་མཚར་ཆེའོ།
en: Seeing such miraculous powers of the bodhisattva great being Dharmodgata, the bodhisattva great being Sadāprarudita and the merchant’s daughter, with her five hundred maidens, thought, ‘How miraculous, how powerful, how resplendent, and how wonderful is this bodhisattva great being Dharmodgata!

source: །རིགས་ཀྱི་བུ་འདི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་དག་རྣམ་པར་སྤྲུལ་ན། ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་པར་གྱུར་ན།
en: Since this noble son emanates such miraculous abilities when he practices the conduct of a bodhisattva, how much more will he do so when he has attained manifest buddhahood in unsurpassed, complete enlightenment!’

source: ལྟ་སྨོས་ཀྱང་ཅི་དགོས། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་དགའ་བ་དང་། གུས་པ་སྐྱེས་ནས་དེ་དག་ཐམས་ཅད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས།
en: Thereupon, in the merchant’s daughter with her five hundred maidens there arose an empathetic joy and respect for the bodhisattva great being Dharmodgata.

source: བདག་ཅག་དགེ་བའི་རྩ་བ་འདིས་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་གྱུར་ཅིག།
en: They all set their minds on unsurpassed, complete enlightenment, and made the following aspiration prayers: ‘Through this root of virtue, may we in the future become tathāgatas, arhats, completely awakened buddhas.

source: བདག་ཅག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་ཆོས་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པས་ཐོབ་པའི་ཆོས་དེ་དག་ཉིད་ཐོབ་པར་གྱུར་ཅིག།
en: Also, when we practice the conduct of a bodhisattva, may we acquire these same attributes that the bodhisattva great being Dharmodgata has acquired!

source: འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེ་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀུར་བསྟི་བྱེད་པ་དེ་ལྟར་བདག་ཅག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀུར་བསྟི་བྱེད་པར་གྱུར་ཅིག །
en: May we revere the perfection of wisdom, just as this sublime bodhisattva great being Dharmodgata reveres the perfection of wisdom!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་འདི་ཇི་ལྟར་འགྲོ་བ་མང་པོ་ལ་རབ་ཏུ་སྟོན་པ་དེ་ལྟར་བདག་ཅག་ཀྱང་འགྲོ་བ་མང་པོ་ལ་རབ་ཏུ་སྟོན་པར་གྱུར་ཅིག །
en: May we reveal it to many living beings, just as this bodhisattva great being Dharmodgata reveals it to many beings!

source: འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཐབས་མཁས་པ་དང་ལྡན་ཞིང་ཡོངས་སུ་རྫོགས་པར་གྱུར་པ་དེ་བཞིན་དུ་བདག་ཅག་ཀྱང་ཐབས་མཁས་པ་དང་ལྡན་ཞིང་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་དེ་ལྟ་བུའི་སྨོན་ལམ་དག་ཀྱང་བཏབ་བོ།
en: May we possess and perfect skill in means with regard to the perfection of wisdom, just as this bodhisattva great being Dharmodgata possesses and perfects skill in means!’ “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དང་། ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མཆོད་པ་བྱས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་ཡང་བཀུར་བསྟི་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Then the bodhisattva great being Sadāprarudita and the merchant’s daughter with her five hundred maidens, after they had presented their offerings to the perfection of wisdom, paid their respects to the bodhisattva great being Dharmodgata, and prostrated their heads at his feet.

source: རྗེ་ས་དང་བཅས་རིམ་གྲོ་དང་བཅས། ཐལ་མོ་སྦྱར་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: With reverence and service, they stood to one side with their palms together.

source: །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བདག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚོལ་བ་ན། དགོན་པ་ཞིག་ནས་སྒྲ་ཐོས་པ། རིགས་ཀྱི་བུ་ཤར་ཕྱོགས་སུ་སོང་ཤིག་དང་། དེ་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོས་པར་འགྱུར་རོ་ཞེས་ཟེར་རོ།
en: Having stood to one side, the bodhisattva great being Sadāprarudita said to the bodhisattva great being Dharmodgata, ‘Noble son, when I was searching for the perfection of wisdom, in the wilderness I heard a voice and journeyed to the east.

source: །དེ་ནས་བདག་གིས་སྒྲ་དེ་ཐོས་པ་དང་། ཤར་ཕྱོགས་གང་ན་བ་དེ་ལོགས་སུ་སོང་སོང་བ་ལས། བདག་འདི་སྙམ་དུ་བདག་གིས་སྒྲ་དེ་ལ་བདག་ཇི་སྲིད་ཅིག་ཏུ་འགྲོ་དགོས་པ་དང་།
en: On the way, I had the thought, “I did not ask that voice how far I should go.

source: སུ་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོས་ཤིང་ཐོབ་པར་འགྱུར་བ་མ་དྲིས་སོ་སྙམ་དུ་བསམས་སོ།
en: I did not ask it from whom I should hear and obtain the perfection of wisdom.”

source: །དེ་ལྟར་བདག་ཡིད་མི་དགའ་བ་དང་མྱ་ངན་ཆེན་པོར་གྱུར་ཅིང་།
en: So I became distressed and sorrowful.

source: ས་ཕྱོགས་དེ་ཉིད་ན་ཉིན་ཞག་བདུན་ལོན་ཏེ། བདག་ཇི་སྲིད་ཅིག་ཏུ་འགྲོ་དགོས། སུ་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཉན་དུ་ཡོད་ཅེས་སྒྲ་དེ་ལ་མ་དྲིས་སོ་སྙམ་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིད་ལ་བྱེད་པའི་མྱ་ངན་ལས་གཞན་པ་ཁ་ཟས་བཟའ་བའི་སེམས་ཀྱང་མ་སྐྱེས་སོ།
en: After passing seven days in that place, wondering why I had not asked that voice how far I should go and from whom I should hear the perfection of wisdom, I did not pay attention even to food and drink, or anything except my sorrow thinking about the perfection of wisdom.

source: །དེ་ནས་བདག་གི་མདུན་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་བྱུང་ནས། དེས་བདག་ལ་འདི་སྐད་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདི་ནས་དཔག་ཚད་ལྔ་བརྒྱ་ན། སྤོས་ཅན་ཞེས་བྱ་བའི་གྲོང་ཁྱེར་ཞིག་ཡོད་དེ། དེར་སོང་ཤིག་དང་།
en: Then in front of me an image of the Tathāgata appeared and said to me, “Noble son, five hundred yojanas from here, there is a city called Gandhavati.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཆད་ཅིང་འདུག་པ་དེ་ཁྱོད་ཀྱིས་མཐོང་བར་འགྱུར་རོ།
en: Go there and you will see the bodhisattva great being Dharmodgata explaining the perfection of wisdom.”

source: །དེ་ནས་བདག་དེ་བཞིན་གཤེགས་པའི་སྐུས་བཀའ་སྩལ་པ་བཞིན་དུ་ཤར་ཕྱོགས་གང་ན་བ་དེ་ལོགས་སུ་སོང་སོང་བ་ལས་རྒྱང་གིས། འཕགས་པ་ཆོས་འཆད་ཅིང་འདུག་པ་མཐོང་ངོ་།
en: Then, just as that image of the Tathāgata advised, I journeyed toward the east, and saw from afar that you were explaining the sublime Dharma.

source: །མཐོང་མ་ཐག་ཏུ་ཡང་དཔེར་ན། བསམ་གཏན་དང་པོ་ལ་མཉམ་པར་བཞག་པའི་དགེ་སློང་གི་བདེ་བ་དེ་ལྟ་བུ་ཐོབ་པར་གྱུར་ཏོ།
en: Immediately after seeing that vision, I acquired a bliss like that of a monk absorbed in the first meditative concentration.

source: །བདག་དགའ་ཞིང་བདེ་བ་དེས་ཁྱབ་པར་གྱུར་ནས། ས་ཕྱོགས་དེ་ཉིད་ནས་མ་གཡོས་པར་ཁྱོད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཆད་ཅིང་འདུག་པ་ཐོས་སོ།
en: I was filled with joy and bliss, and without moving from that very spot, I heard you explaining the perfection of wisdom.

source: །དེ་ཐོས་ནས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བརྒྱ་ཕྲག་དུ་མ་སྐྱེས་པར་གྱུར་ཏོ།
en: After hearing that, many hundreds of gateways of meditative stability arose. {

source: །བདག་དེ་ན་འདུག་པའི་ཚེ་ཡང་ཕྱོགས་བཅུ་ནས་དེ་བཞིན་གཤེགས་པ་རྣམས་བདག་ལ་དབུགས་འབྱིན་པ་མཛད་ཅིང་རིགས་ཀྱི་བུ་ཏིང་ངེ་འཛིན་འདི་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ཡིན་པས་ལེགས་སོ།
en: Va.252} When I stood there, also the tathāgatas inspired me from the ten directions, saying, “Noble son, these meditative stabilities have emerged from the perfection of wisdom. Excellent!

source: །ངེད་ཀྱིས་ཀྱང་དེ་དག་ལ་གནས་ནས། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱས་སོ།
en: Established in it, we, too, perfected the attributes of the buddhas!”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་བདག་ལ་ཤིན་དུ་ལེགས་པར་བསྟན་ནས་མི་སྣང་བར་གྱུར་ཏོ།
en: Then after teaching me most excellently, these tathāgatas disappeared.

source: །བདག་ཀྱང་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་འདི་སྙམ་དུ་གྱུར་ཏོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་གང་ནས་བྱོན། དེ་བཞིན་གཤེགས་པ་དེ་དག་གར་གཤེགས་སྙམ་མོ།
en: I arose from that meditative stability and thought, “From where did these tathāgatas come, and where have they gone?”

source: །དེ་ནས་ཡང་བདག་འདི་སྙམ་དུ་གྱུར་ཏེ། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེ་ནི་སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་བྱས་པ་དགེ་བའི་རྩ་བ་བསྐྲུན་པ།
en: Then I had the further thought, “The sublime bodhisattva great being Dharmodgata has cultivated the roots of virtuous action, having undertaken duties on behalf of the conquerors of the past.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཐབས་མཁས་པ་ལ་བསླབས་པ་ཡིན་པས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གང་ནས་བྱོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེ་དག་གང་དུ་བཞུད་པ་དེ་བདག་ལ་སྟོན་ཏོ་སྙམ་མོ།
en: Since he has trained in the skill in means associated with the perfection of wisdom, he will show me from where these tathāgatas came, and where these tathāgatas went.”

source: །དེ་བས་ན་རིགས་ཀྱི་བུ་ཁྱོད་ལ་དེ་བཞིན་གཤེགས་པ་དེ་དག་གང་ནས་བྱོན། དེ་བཞིན་གཤེགས་པ་དེ་དག་གང་དུ་བཞུད་པ་བདག་འདྲི་ཡིས།
en: Therefore, noble son, I ask you from where these tathāgatas came, and where these tathāgatas have gone.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ག་ལས་བྱོན་པ་དང་། གར་བཞུད་པ་ཅི་ནས་ཀྱང་བདག་ཅག་གིས་ཤེས་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འགྱུར་བ་དེ་ལྟ་བུར་བདག་ལ་སྟོན་ཅིག །
en: Teach me, noble son, so that we may know from where these tathāgatas came, and where they have gone, and so that we may behold the tathāgatas!’ ”
